## Imorting Numpy and Pandas

In [1]:
#Importing the libraries
import numpy as np
import pandas as pd

Data Representation in Pandas:<br>
    1. Series<br>
       similar to 1d numpy array(column) with custom index
       numpy array [ 1
                     2
                     4
                     6]
       Series:
       Index     Values
         0          2
         1          3
         .
         .
         7          9
         
         Index     Values
         S1          67
         S2          86
         .
         .
         .
         
    2. DataFrame

## Pandas Series Object

syntax: pd.Series(data, index, dtype)
 index and dtype are optional

In [2]:
arr = np.array([1,2,4])
print(arr)

[1 2 4]

In [6]:
# index: default integer index(0,1,2,...)
series = pd.Series(data=[78, 92, 36, 64, 89]) 
series

0    78
1    92
2    36
3    64
4    89
dtype: int64

In [7]:
#Displaying values # series.tap
series.values

array([78, 92, 36, 64, 89], dtype=int64)

In [8]:
#Displaying index
series.index
# 0,1,2,3,4

RangeIndex(start=0, stop=5, step=1)

In [9]:
#Accessing second value
series[1]

92

In [10]:
#Accessing a slice of values
series[1:3] # last value is exclusive

1    92
2    36
dtype: int64

### Custom index in series

In [11]:
data = pd.Series(data = [700000, 800000, 1600000, 1800000, 30000000], 
                 index = ['Swift', 'Jazz', 'Civic', 'Altis', 'Gallardo'])
data

Swift         700000
Jazz          800000
Civic        1600000
Altis        1800000
Gallardo    30000000
dtype: int64

In [12]:
#Accessing price of Swift
data['Jazz']

800000

In [13]:
data[1]  # despite there's custom index, numeric index(default index) can be used

800000

In [14]:
#Accessing slice of data
data['Jazz':'Gallardo']

Jazz          800000
Civic        1600000
Altis        1800000
Gallardo    30000000
dtype: int64

In [15]:
data[1:4]

Jazz      800000
Civic    1600000
Altis    1800000
dtype: int64

### Series as a specialized dictionary

In [18]:
#Using dictionary to create a series dict=> key:value  series => index:value
car_price_dict = {'Swift':  700000,
                       'Jazz' :  800000,
                       'Civic' : 1600000,
                       'Altis' : 1800000,
                       'Gallardo': 30000000
                      }
car_price = pd.Series(car_price_dict, dtype=float)
car_price

Swift         700000.0
Jazz          800000.0
Civic        1600000.0
Altis        1800000.0
Gallardo    30000000.0
dtype: float64

## Pandas Dataframe Object

a collection of series, all sharing the same index
store the data in the form of rows and columns
Index    Col1   Col2   Col3.....
0
1
2
3
4

Col1, Col2, Col3,... are the series sharing the same index

In [19]:
#Creating a car price series with a dictionary
car_price_dict = {'Swift':  700000,
                       'Jazz' :  800000,
                       'Civic' : 1600000,
                       'Altis' : 1800000,
                       'Gallardo': 30000000
                      }
car_price = pd.Series(car_price_dict)
# Creating the car manufacturer series with a dictionary
car_man_dict = {'Swift' : 'Maruti',
                  'Jazz'   : 'Honda',
                  'Civic'  : 'Honda',
                  'Altis'  : 'Toyota',
                   'Gallardo' : 'Lamborghini'}
car_man = pd.Series(car_man_dict)
print(car_price)
print(car_man)

Swift         700000
Jazz          800000
Civic        1600000
Altis        1800000
Gallardo    30000000
dtype: int64
Swift            Maruti
Jazz              Honda
Civic             Honda
Altis            Toyota
Gallardo    Lamborghini
dtype: object

In [20]:
# syntax: pd.DataFrame(data, index, columns)
# Clubbing different series together to create a dataframe
# series: index: values
cars = pd.DataFrame({'Price': car_price , 'Manufacturer' : car_man})
#                     column1 name           column2 name
# custom index will be taken automatically from the given series

cars

             Price Manufacturer
Swift       700000       Maruti
Jazz        800000        Honda
Civic      1600000        Honda
Altis      1800000       Toyota
Gallardo  30000000  Lamborghini

In [21]:
#Accessing individual column
cars['Price']

Swift         700000
Jazz          800000
Civic        1600000
Altis        1800000
Gallardo    30000000
Name: Price, dtype: int64

In [22]:
#Accessing individual column
cars['Manufacturer']

Swift            Maruti
Jazz              Honda
Civic             Honda
Altis            Toyota
Gallardo    Lamborghini
Name: Manufacturer, dtype: object

### Methods to create a dataframe

### From a single series object

In [23]:
#Using dictionary to create a series
car_price_dict = {'Swift':  700000,
                       'Jazz' :  800000,
                       'Civic' : 1600000,
                       'Altis' : 1800000,
                       'Gallardo': 30000000
                      }
car_price = pd.Series(car_price_dict)
car_price
#Creating a DataFrame from car_price Series
pd.DataFrame(car_price, columns=['Car Price'])

          Car Price
Swift        700000
Jazz         800000
Civic       1600000
Altis       1800000
Gallardo   30000000

### From a list of dictionaries

In [25]:
data = [{'Name': 'Subodh', 'Marks': 28},
        {'Name': 'Ram', 'Marks': 27}, 
        {'Name': 'Abdul', 'Marks': 26}, 
        {'Name': 'John', 'Marks': 28}]
pd.DataFrame(data, index=['R1','R2','R3','R4'])

      Name  Marks
R1  Subodh     28
R2     Ram     27
R3   Abdul     26
R4    John     28

In [26]:
# Pandas handles missing data with ease
pd.DataFrame([{'Subodh':20, 'Ram':25},{'Abdul':29, 'John':24}], index = ['Mathematics', 'Physics'])

             Subodh   Ram  Abdul  John
Mathematics    20.0  25.0    NaN   NaN
Physics         NaN   NaN   29.0  24.0

In [31]:
list1 = [[1.0,4,6],
         [2,4,8]]
pd.DataFrame(data = list1, columns =['C1','C2','C3'], index=['R1','R2'],dtype=int)

    C1  C2  C3
R1   1   4   6
R2   2   4   8

## Working with Datasets in Pandas

1. Read the data
2. Explore the data
3. Applying operations: filtering, grouping, merge, etc.
4. Data visualization
5. Generate the insights

### Importing a dataset as a dataframe object

dir(pd)

In [33]:
# pd.read_csv('filepath') filepath = Dataset/fileName.csv
df = pd.read_csv('auto_mpg.csv')
# if file is present in same folder
df

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
...,...,...,...,...,...,...,...,...,...
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10

In [35]:
#displaying head: display first 5 rows by default
df.head(10)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
5,15.0,8,429.0,198.0,4341,10.0,70,usa,ford galaxie 500
6,14.0,8,454.0,220.0,4354,9.0,70,usa,chevrolet impala
7,14.0,8,440.0,215.0,4312,8.5,70,usa,plymouth fury iii
8,14.0,8,455.0,225.0,4425,10.0,70,usa,pontiac catalina
9,15.0,8,390.0,190.0,3850,8.5,70,usa,amc ambassador dpl

In [37]:
#displaying tail: last 5 rows(by default)
df.tail(7)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
391,36.0,4,135.0,84.0,2370,13.0,82,usa,dodge charger 2.2
392,27.0,4,151.0,90.0,2950,17.3,82,usa,chevrolet camaro
393,27.0,4,140.0,86.0,2790,15.6,82,usa,ford mustang gl
394,44.0,4,97.0,52.0,2130,24.6,82,europe,vw pickup
395,32.0,4,135.0,84.0,2295,11.6,82,usa,dodge rampage
396,28.0,4,120.0,79.0,2625,18.6,82,usa,ford ranger
397,31.0,4,119.0,82.0,2720,19.4,82,usa,chevy s-10

In [38]:
#Using describe function to get a quick summary of descriptive statistics
df.describe()
# non null value: count

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year
count,398.000000,398.000000,398.000000,392.000000,398.000000,398.000000,398.000000
mean,23.514573,5.454774,193.425879,104.469388,2970.424623,15.568090,76.010050
std,7.815984,1.701004,104.269838,38.491160,846.841774,2.757689,3.697627
min,9.000000,3.000000,68.000000,46.000000,1613.000000,8.000000,70.000000
25%,17.500000,4.000000,104.250000,75.000000,2223.750000,13.825000,73.000000
50%,23.000000,4.000000,148.500000,93.500000,2803.500000,15.500000,76.000000
75%,29.000000,8.000000,262.000000,126.000000,3608.000000,17.175000,79.000000
max,46.600000,8.000000,455.000000,230.000000,5140.000000,24.800000,82.000000

In [39]:
df.describe(include="O")
# categorical data
# count, which value is most frequent(mode)

       origin        name
count     398         398
unique      3         305
top       usa  ford pinto
freq      249           6

In [40]:
df.info()
# Index: 
# each column it will display the number of non null values, datatype

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 398 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           398 non-null    float64
 1   cylinders     398 non-null    int64
 2   displacement  398 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        398 non-null    int64
 5   acceleration  398 non-null    float64
 6   model_year    398 non-null    int64
 7   origin        398 non-null    object
 8   name          398 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.1+ KB

### Dropping null values
1. Dropping the missing value(rows/columns)
   mpg   cyn   origin
0   -    12     usa  -> removed
1   12.4 4      japan
2   -    5      japan -> removed

   removed 
2. Imputation(EDA)

In [43]:
#Using dropna to drop nulll/missing values
# axis: 0(rows), 1(columns)
# dropna: drop rows/columns which are having null values
df.dropna(axis=0, inplace = True)

           col2     col3  
row1         23      45
row2         34      23
 dropna(axis=0)
    col1      col2    col3
row2  56       34      23

In [ ]:
df

In [44]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        392 non-null    int64
 5   acceleration  392 non-null    float64
 6   model_year    392 non-null    int64
 7   origin        392 non-null    object
 8   name          392 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 30.6+ KB

## Indexing and selection

### Selecting a subset of data

In [46]:
df[['name']]   # Output: DataFrame

                          name
0    chevrolet chevelle malibu
1            buick skylark 320
2           plymouth satellite
3                amc rebel sst
4                  ford torino
..                         ...
393            ford mustang gl
394                  vw pickup
395              dodge rampage
396                ford ranger
397                 chevy s-10

[392 rows x 1 columns]

In [45]:
df['name']  # Output: Series

0      chevrolet chevelle malibu
1              buick skylark 320
2             plymouth satellite
3                  amc rebel sst
4                    ford torino
                 ...
393              ford mustang gl
394                    vw pickup
395                dodge rampage
396                  ford ranger
397                   chevy s-10
Name: name, Length: 392, dtype: object

In [47]:
df[['name', 'origin', 'model_year', 'mpg']]

                          name  origin  model_year   mpg
0    chevrolet chevelle malibu     usa          70  18.0
1            buick skylark 320     usa          70  15.0
2           plymouth satellite     usa          70  18.0
3                amc rebel sst     usa          70  16.0
4                  ford torino     usa          70  17.0
..                         ...     ...         ...   ...
393            ford mustang gl     usa          82  27.0
394                  vw pickup  europe          82  44.0
395              dodge rampage     usa          82  32.0
396                ford ranger     usa          82  28.0
397                 chevy s-10     usa          82  31.0

[392 rows x 4 columns]

### Setting custom index

In [61]:
#creating a subset using head
df_head = df.head()
df_head

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [62]:
#Setting name as custom index
df_head.set_index('name', inplace = True)

In [63]:
df_head

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin
name,,,,,,,,
chevrolet chevelle malibu,18.0,8,307.0,130.0,3504,12.0,70,usa
buick skylark 320,15.0,8,350.0,165.0,3693,11.5,70,usa
plymouth satellite,18.0,8,318.0,150.0,3436,11.0,70,usa
amc rebel sst,16.0,8,304.0,150.0,3433,12.0,70,usa
ford torino,17.0,8,302.0,140.0,3449,10.5,70,usa

function(10):
    ....
    return x
a = 10
print(function(a))  # a remains same
a = function(a)  # change will be reflected in a

In [65]:
df_head.reset_index(drop=False)
# drop = False will store the previous index as a column
# drop = True, will drop the previous index
# reset the index to default( 0, 1, 2,...)

,name,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin
0,chevrolet chevelle malibu,18.0,8,307.0,130.0,3504,12.0,70,usa
1,buick skylark 320,15.0,8,350.0,165.0,3693,11.5,70,usa
2,plymouth satellite,18.0,8,318.0,150.0,3436,11.0,70,usa
3,amc rebel sst,16.0,8,304.0,150.0,3433,12.0,70,usa
4,ford torino,17.0,8,302.0,140.0,3449,10.5,70,usa

In [67]:
df_head['column'] = [2,6,7,4,6]
df_head

C:\Users\tanvi.porwal\AppData\Local\Temp/ipykernel_29872/3577358631.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_head['column'] = [2,6,7,4,6]

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,column
name,,,,,,,,,
chevrolet chevelle malibu,18.0,8,307.0,130.0,3504,12.0,70,usa,2
buick skylark 320,15.0,8,350.0,165.0,3693,11.5,70,usa,6
plymouth satellite,18.0,8,318.0,150.0,3436,11.0,70,usa,7
amc rebel sst,16.0,8,304.0,150.0,3433,12.0,70,usa,4
ford torino,17.0,8,302.0,140.0,3449,10.5,70,usa,6

### Accessing Rows

In [68]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [69]:
df[['mpg','origin']]

      mpg  origin
0    18.0     usa
1    15.0     usa
2    18.0     usa
3    16.0     usa
4    17.0     usa
..    ...     ...
393  27.0     usa
394  44.0  europe
395  32.0     usa
396  28.0     usa
397  31.0     usa

[392 rows x 2 columns]

### Using iloc
iloc: using default integer index <br>
loc: using the custom index

In [73]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 392 entries, 0 to 397
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     392 non-null    int64
 2   displacement  392 non-null    float64
 3   horsepower    392 non-null    float64
 4   weight        392 non-null    int64
 5   acceleration  392 non-null    float64
 6   model_year    392 non-null    int64
 7   origin        392 non-null    object
 8   name          392 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 30.6+ KB

In [74]:
df.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino

In [75]:
#Getting third row value of second value of second column
# DataFrame.iloc[row,column]
df.iloc[2]  # selecting 2nd row

mpg                           18.0
cylinders                        8
displacement                 318.0
horsepower                   150.0
weight                        3436
acceleration                  11.0
model_year                      70
origin                         usa
name            plymouth satellite
Name: 2, dtype: object

In [78]:
#df.iloc[2][2]
df.iloc[2,2]  # selecting 2nd column from 2nd row

318.0

In [79]:
#Getting third row value of last column
df.iloc[2,-2]
# negative indexing
# 18.0	8	318.0	150.0	3436	11.0	70	usa	plymouth satellite
# 0     1    2
#                                           -3     -2      -1

'usa'

In [80]:
#Getting a slice of data
df.iloc[1:5, 4:6]

   weight  acceleration
1    3693          11.5
2    3436          11.0
3    3433          12.0
4    3449          10.5

In [81]:
df.iloc[0, -1]

'chevrolet chevelle malibu'

### Using loc

In [82]:
#creating a subset using head
df_head = df.head()
#Setting name as custom index
df_head.set_index('name', inplace = True)
df_head

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin
name,,,,,,,,
chevrolet chevelle malibu,18.0,8,307.0,130.0,3504,12.0,70,usa
buick skylark 320,15.0,8,350.0,165.0,3693,11.5,70,usa
plymouth satellite,18.0,8,318.0,150.0,3436,11.0,70,usa
amc rebel sst,16.0,8,304.0,150.0,3433,12.0,70,usa
ford torino,17.0,8,302.0,140.0,3449,10.5,70,usa

In [83]:
df_head['mpg']

name
chevrolet chevelle malibu    18.0
buick skylark 320            15.0
plymouth satellite           18.0
amc rebel sst                16.0
ford torino                  17.0
Name: mpg, dtype: float64

In [84]:
df_head.loc['plymouth satellite']

mpg              18.0
cylinders           8
displacement    318.0
horsepower      150.0
weight           3436
acceleration     11.0
model_year         70
origin            usa
Name: plymouth satellite, dtype: object

In [85]:
df_head.loc['buick skylark 320': 'amc rebel sst', ['mpg','model_year']]

                     mpg  model_year
name
buick skylark 320   15.0          70
plymouth satellite  18.0          70
amc rebel sst       16.0          70

In [86]:
df.head(10)

,mpg,cylinders,displacement,horsepower,weight,acceleration,model_year,origin,name
0,18.0,8,307.0,130.0,3504,12.0,70,usa,chevrolet chevelle malibu
1,15.0,8,350.0,165.0,3693,11.5,70,usa,buick skylark 320
2,18.0,8,318.0,150.0,3436,11.0,70,usa,plymouth satellite
3,16.0,8,304.0,150.0,3433,12.0,70,usa,amc rebel sst
4,17.0,8,302.0,140.0,3449,10.5,70,usa,ford torino
5,15.0,8,429.0,198.0,4341,10.0,70,usa,ford galaxie 500
6,14.0,8,454.0,220.0,4354,9.0,70,usa,chevrolet impala
7,14.0,8,440.0,215.0,4312,8.5,70,usa,plymouth fury iii
8,14.0,8,455.0,225.0,4425,10.0,70,usa,pontiac catalina
9,15.0,8,390.0,190.0,3850,8.5,70,usa,amc ambassador dpl

In [87]:
#Subsetting from full dataset
# with custom index: it considers last value
df.loc[0:5, ['cylinders', 'horsepower', 'name']]

   cylinders  horsepower                       name
0          8       130.0  chevrolet chevelle malibu
1          8       165.0          buick skylark 320
2          8       150.0         plymouth satellite
3          8       150.0              amc rebel sst
4          8       140.0                ford torino
5          8       198.0           ford galaxie 500

In [88]:
df.iloc[0:5,2:4]

   displacement  horsepower
0         307.0       130.0
1         350.0       165.0
2         318.0       150.0
3         304.0       150.0
4         302.0       140.0

### Adding a new column

In [ ]:
marks = {'Chemistry': [67,90,66,32], 
        'Physics': [45,92,72,40],  
        'Mathematics': [50,87,81,12],  
        'English': [19,90,72,68]}
marks_df = pd.DataFrame(marks, index = ['Subodh', 'Ram', 'Abdul', 'John'])
marks_df

In [ ]:
#Adding total marks column as a sum of all subjects
marks_df['Total'] = marks_df['Chemistry'] + marks_df['Physics'] + marks_df['Mathematics'] + marks_df['English']
marks_df

In [ ]:
#Dropping the newly created column
marks_df.drop(columns = 'Total', inplace = True)

In [ ]:
marks_df

In [ ]:
marks_df.drop(index='Subodh', inplace = True, axis=1)

In [ ]:
marks_df

## Operations on DataFrames

### Filtering operation

In [ ]:
df

In [ ]:
# select the data points/rows where model_year should be 72
df.loc[df['model_year'] == 72 ]

In [ ]:
df.loc[(df['origin'] == 'japan') & (df['cylinders'] == 6)]

In [ ]:
# Fuel efficient
# MPG > 29, Horsepower < 93.5,
# Weight < 2500
df.loc[(df['mpg'] > 29) & (df['horsepower'] < 93.5) & (df['weight'] < 2500)]

In [ ]:
# Muscle cars
# Displacement >262, Horsepower > 126, Weight in range[2800, 3600]
df.loc[(df['displacement'] > 262) & (df['horsepower'] > 126) & (df['weight'] >=2800) & (df['weight'] <= 3600)]

In [ ]:
# SUV
# Horsepower > 140 , Weight > 4500
df.loc[(df['horsepower'] > 140) & (df['weight'] >=4500)]

In [ ]:
# Racecar
# Weight <2223, acceleration > 17
df.loc[(df['acceleration'] > 17) & (df['weight'] < 2223)]

### Masking operations

In [ ]:
marks = [{'Chemistry': 67, 'Physics': 45, 'Mathematics': 50, 'English' : 19},
        {'Chemistry': 90, 'Physics': 92, 'Mathematics': 87, 'English' : 90}, 
        {'Chemistry': 66, 'Physics': 72, 'Mathematics': 81, 'English' : 72}, 
        {'Chemistry': 32, 'Physics': 40, 'Mathematics': 12, 'English' : 68}]
marks_df = pd.DataFrame(marks, index = ['Subodh', 'Ram', 'Abdul', 'John'])
marks_df

In [ ]:
f = marks_df < 33  # condition
marks_df.mask(f, 'Fail')

###  Sorting Data

In [ ]:
df

In [ ]:
df.sort_values(by = 'displacement', ascending = False)
# sorting will be done in ascending order: by default

In [ ]:
df.sort_values(['cylinders'])

In [ ]:
df.sort_values(['cylinders','model_year','horsepower'])

In [ ]:
df.sort_values(['cylinders', 'horsepower'])

In [ ]:
# ascending: True(1)/False(0), 
df.sort_values(['cylinders', 'horsepower'], ascending = (0,1))
# 0 -> descending
# 1 -> ascending

In [ ]:
marks = [{'Chemistry': 67, 'Physics': 45, 'Mathemarics': 50, 'English' : 19},
        {'Chemistry': 90, 'Physics': 92, 'Mathemarics': 87, 'English' : 90}, 
        {'Chemistry': 66, 'Physics': 72, 'Mathemarics': 81, 'English' : 72}, 
        {'Chemistry': 32, 'Physics': 40, 'Mathemarics': 12, 'English' : 68}]
marks_df = pd.DataFrame(marks, index = ['Subodh', 'Ram', 'Abdul', 'John'])
marks_df

#### Resetting index
reset to default index

In [ ]:
# reset_index: reset the index to default(0,1,2,...)
marks_df.reset_index(inplace = True, drop = True)
# marks_df.reset_index(inplace = True)
marks_df
# drop: True,drop the previous index
#       False, add the previous index as a column

In [ ]:
marks = [{'Chemistry': 67, 'Physics': 45, 'Mathemarics': 50, 'English' : 19},
        {'Chemistry': 90, 'Physics': 92, 'Mathemarics': 87, 'English' : 90}, 
        {'Chemistry': 66, 'Physics': 72, 'Mathemarics': 81, 'English' : 72}, 
        {'Chemistry': 32, 'Physics': 40, 'Mathemarics': 12, 'English' : 68}]
marks_df = pd.DataFrame(marks, index = ['Subodh', 'Ram', 'Abdul', 'John'])
# reset_index: reset the index to default(0,1,2,...)
marks_df.reset_index(inplace = True)
# marks_df.reset_index(inplace = True)
marks_df

In [ ]:
marks = [{'Chemistry': 67, 'Physics': 45, 'Mathemarics': 50, 'English' : 19, 'Name': "S"},
        {'Chemistry': 90, 'Physics': 92, 'Mathemarics': 87, 'English' : 90, 'Name': "R"}, 
        {'Chemistry': 66, 'Physics': 72, 'Mathemarics': 81, 'English' : 72, 'Name': "A"}, 
        {'Chemistry': 32, 'Physics': 40, 'Mathemarics': 12, 'English' : 68, 'Name': "J"}]
marks_df = pd.DataFrame(marks)
marks_df

In [ ]:
marks_df.set_index("Name")

In [ ]:
marks_df

### Aggregation operation in pandas

In [ ]:
df.info()

In [ ]:
df.columns

In [ ]:
df['mpg'].dtype

In [ ]:
#Using list comprehension
list1 = [col for col in df.columns if df[col].dtype in ['float', 'int64']]
list1

In [ ]:
df[list1].agg(['min', 'max', 'count'])

### Grouping operation in pandas

In [ ]:
#Grouping accoring to model year, aggreagate function is mandatory
df.groupby(['model_year']).count()[['origin']]

In [ ]:
#Grouping  data on the basis of multiple columns
grouped_multiple = df.groupby(['cylinders', 'model_year']).agg({'horsepower': ['mean', 'min', 'max']})
grouped_multiple.columns = ['hp_mean', 'hp_min', 'hp_max']
grouped_multiple = grouped_multiple.reset_index()
grouped_multiple

In [ ]:
df.groupby(['model_year']).mean()[['acceleration']]

In [ ]:
#Sorting based on acceleration mean value"
df.groupby(['model_year']).mean().sort_values('acceleration', ascending = False)[['acceleration']]

In [ ]:
#Using list comprehension
list1 = [col for col in df.columns if df[col].dtype in ['float', 'int64']]
df[list1].groupby(['cylinders']).agg(['min','max'])

## Combining Dataframes

In [ ]:
marks_A = {'Chemistry': [67,90,66,32], 
        'Physics': [45,92,72,40],  
          }
marks_A_df = pd.DataFrame(marks_A, index = ['Subodh', 'Ram', 'Abdul', 'John'])

marks_B = {'Chemistry': [72,45,60,98], 
        'Physics': [78,34,72,95],  
          }
marks_B_df = pd.DataFrame(marks_B, index = ['Nandini', 'Zoya', 'Shivam', 'James'])

In [ ]:
marks_A_df

In [ ]:
marks_B_df

In [ ]:
#Using concat function
pd.concat([marks_A_df,marks_B_df])

In [ ]:
marks_C = {'Math': [67,90,66,32], 
        'English': [45,92,72,40],  
          }
marks_C_df = pd.DataFrame(marks_C, index = ['Subodh', 'Ram', 'Abdul', 'John'])

In [ ]:
marks_C_df

In [ ]:
marks_A_df

In [ ]:
pd.concat([marks_A_df,marks_C_df],axis=1)

In [ ]:
df1 = pd.DataFrame({'employee': ['Jyoti', 'Sapna', 'Raj', 'Ramaswamy'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Jyoti', 'Sapna', 'Raj', 'Ramaswamy'],
                    'hire_date': [2004, 2008, 2012, 2014]})
display(df1,df2)

In [ ]:
#Using concat
pd.concat([df1,df2], sort = False)

In [ ]:
dfx =pd.concat([df1,df2], sort = False).reset_index(drop=True)
dfx

### Merge in case of column mismatch

In [ ]:
df1 = pd.DataFrame({'employee': ['Jyoti', 'Sapna', 'Raj', 'Ramaswamy'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'name': ['Jyoti', 'Raj', 'Sapna', 'Ramaswamy'],
                    'hire_date': [2004, 2008, 2012, 2014]})
display(df1,df2)

In [ ]:
df3 = pd.merge(df1,df2,left_on='employee', right_on='name')
df3

In [ ]:
df1 = pd.DataFrame({'employee': ['Jyoti', 'Sapna', 'Raj', 'Ramaswamy'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Jyoti', 'Raj', 'Sapna', 'Ramaswamy', 'XYZ'],
                    'hire_date': [2004, 2008, 2012, 2014, 2017]})
display(df1,df2)

In [ ]:
df3 = pd.merge(df1,df2,on='employee', how ='right')
df3

#on = 1 column, a list of column[ should be present on both the dataFrames]
#in case, you have a column with same values but different name
#left_on = column from first dataFrame
#right_on = column from second DataFRame

## Crosstab

In [ ]:
#Using crosstab for getting a frequency distribution
pd.crosstab(df['model_year'], df['origin'])
                       #         cylinders
          #          3     4    5    6     8
#   Model year 72   12   34

## Pivot table

In [ ]:
#Using pivot table to use an aggregate function
# pivot1 = pd.pivot_table(df, index = 'model_year', aggfunc=np.sum)
pivot1 = pd.pivot_table(df, index = 'model_year', aggfunc=['min','max'], values= ['cylinders','displacement'])
#  index => column based on which index will be
# values => columns on which aggregate function will be applied
pivot1

## Pandas Plots

### Scatter Plot
to check the relationship/association between the numeric column
numeric vs numeric

In [ ]:
df.plot(x = 'horsepower', y = 'acceleration', marker = 's', kind = 'scatter')

### Bar plot
categorical vs numeric

In [ ]:
my_df=df.groupby('model_year').mean()[['acceleration']]
my_df

In [ ]:
my_df.plot(kind = 'bar')

### Histogram
continuos data vs freq

In [ ]:
df['mpg'].plot(kind = 'hist')

In [ ]:
# Viewing a linear relationship with the help of scatter plot
df.plot(x = 'weight', y = 'mpg', kind = 'scatter');
# 392

In [ ]:
# sorted mean values of acceleration with respect to number of cylinders.
df.groupby('cylinders').mean().sort_values('acceleration')[['acceleration']].plot(kind = 'bar')